autocannon_beats.log
nohup: ignoring input
Running 120s test @ http://localhost:3000/beats
50 connections


┌─────────┬───────┬───────┬───────┬───────┬──────────┬─────────┬────────┐
│ Stat    │ 2.5%  │ 50%   │ 97.5% │ 99%   │ Avg      │ Stdev   │ Max    │
├─────────┼───────┼───────┼───────┼───────┼──────────┼─────────┼────────┤
│ Latency │ 16 ms │ 33 ms │ 58 ms │ 67 ms │ 31.95 ms │ 12.1 ms │ 398 ms │
└─────────┴───────┴───────┴───────┴───────┴──────────┴─────────┴────────┘
┌───────────┬────────┬────────┬────────┬─────────┬──────────┬────────┬────────┐
│ Stat      │ 1%     │ 2.5%   │ 50%    │ 97.5%   │ Avg      │ Stdev  │ Min    │
├───────────┼────────┼────────┼────────┼─────────┼──────────┼────────┼────────┤
│ Req/Sec   │ 1,044  │ 1,054  │ 1,337  │ 2,791   │ 1,540.95 │ 525.83 │ 880    │
├───────────┼────────┼────────┼────────┼─────────┼──────────┼────────┼────────┤
│ Bytes/Sec │ 615 kB │ 621 kB │ 788 kB │ 1.64 MB │ 908 kB   │ 310 kB │ 518 kB │
└───────────┴────────┴────────┴────────┴─────────┴──────────┴────────┴────────┘

Req/Bytes counts sampled once per second.
# of samples: 120

185k requests in 120.1s, 109 MB read